import 'package:flutter/material.dart';

const Color kPrimitiveColor = Color(0xff3E6897);
const Color kTextColor = Color(0xff4F4E4E);
const Color kTextBlackColor = Color(0xff222222);
const kBackgroundColor = Color(0xff121012);

const Duration kTransitionDuration = Duration(milliseconds: 250);
const String arabicString = '''
الشروط : بدخولك إلى الموقع فأنت توافق على الإلتزام بهذه الشروط، وعلى جميع القوانين واللوائح المعمول بها، وتقر كذلك بأنك مسئول عن الإمتثال لأي قوانين محلية سارية .

إذا كنت لا توافق على أي من هذه الشروط، فلا يحق لك استخدام أو الدخول إلى هذا الموقع.
جميع المواد الواردة في هذا الموقع محمية بموجب حقوق النشر المعمول بها وبموجب قانون حماية العلامات التجارية .
القانون المنظم : تخضع هذه الشروط والأحكام ويؤول تفسيرها إلى قوانين المملكة العربية السعودية وتخضع أنت كذلك وبشكل غير قابل للنقض للإختصاص القضائي لمحاكم المملكة العربية السعودية .

سياسة الخصوصية : تعتبر الخصوصية والأمن أقصى الأولويات في حيث أننا لم نقم على الإطلاق بمشاركة أو طباعة أو بيع معلومات أي زبون لأي طرف آخر . عند قيامك بتقديم المعلومات الشخصية على موقعنا سنعمل بكل جهد على حماية معلوماتك على الإنترنت وخارجه . نقوم باستخدام مجموعة متنوعة من تقنيات وإجراءات الأمان للمساعدة على حماية معلوماتك الشخصية من الوصول أو الاستخدام أو الكشف غير المصرح به حالما نقوم بإستلامها. على سبيل المثال، نحن نقوم بتخزين معلوماتك الشخصية على أنظمة كمبيوتر ذات وصول محدود 
لمصرح لهم بالإطلاع على هذه المعلومات ، ويتم تدريب موظفينا على التعامل الآمن مع هذه المعلومات والبيانات وإبقائهم مطلعين على آخر المستجدات التي تتعلق بالإجراءات الأمنية .

خصوصية حسابك : أنت مسؤول عن الحفاظ على سرية بيانات حسابك وكلمة المرور وتحديد من يصل إلى جهاز الكمبيوتر الخاص بك أو التطبيق الخاص بنا ، كما أنك توافق على قبول المسؤولية عن جميع الأنشطة التي تتم من خلال حسابك أو كلمة المرور الخاصة بك إذا كان عمرك أقل من 18 سنة، فلا يجوز لك استخدام خدمات إلا بإشراك أحد

الوالدين أو ولي الأمر . نحتفظ بالحق في رفض تقديم الخدمة، أو إنهاء الحسابات، أو إزالة أو تعديل المحتوى، أو إلغاء الأوامر وفقا للتقدير الخاص .
''';
